In [32]:
import numpy as np
import pandas as pd
df=pd.read_csv("Data123.csv")
print(df)

   Country  Age  Salary Purchased
0   France   44   72000        No
1    Spain   -9      -5       Yes
2  Germany   -9   54000        No
3    Spain   38   61000        No
4  Germany   40      -5       Yes
5   France   35   58000       Yes
6    Spain   -9      -5        No
7   France   48   79000       Yes
8  Germany   50   83000        No
9   France   -9   67000       Yes

In [31]:
newdf=df.replace(-9,np.NaN)
print(newdf)

   Country   Age  Salary Purchased
0   France  44.0   72000        No
1    Spain   NaN      -5       Yes
2  Germany   NaN   54000        No
3    Spain  38.0   61000        No
4  Germany  40.0      -5       Yes
5   France  35.0   58000       Yes
6    Spain   NaN      -5        No
7   France  48.0   79000       Yes
8  Germany  50.0   83000        No
9   France   NaN   67000       Yes

In [33]:
newdf=df.replace([-9,-5,'No'],np.NaN)
print(newdf)
print(df)

   Country   Age   Salary Purchased
0   France  44.0  72000.0       NaN
1    Spain   NaN      NaN       Yes
2  Germany   NaN  54000.0       NaN
3    Spain  38.0  61000.0       NaN
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN      NaN       NaN
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0       NaN
9   France   NaN  67000.0       Yes
   Country  Age  Salary Purchased
0   France   44   72000        No
1    Spain   -9      -5       Yes
2  Germany   -9   54000        No
3    Spain   38   61000        No
4  Germany   40      -5       Yes
5   France   35   58000       Yes
6    Spain   -9      -5        No
7   France   48   79000       Yes
8  Germany   50   83000        No
9   France   -9   67000       Yes

In [34]:
newdf=df.replace({
    'Age':-9,
    'Salary':-5,
    'Purchased':'No'
    
},np.NaN)
print(newdf)

   Country   Age   Salary Purchased
0   France  44.0  72000.0       NaN
1    Spain   NaN      NaN       Yes
2  Germany   NaN  54000.0       NaN
3    Spain  38.0  61000.0       NaN
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN      NaN       NaN
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0       NaN
9   France   NaN  67000.0       Yes

In [35]:
df

   Country  Age  Salary Purchased
0   France   44   72000        No
1    Spain   -9      -5       Yes
2  Germany   -9   54000        No
3    Spain   38   61000        No
4  Germany   40      -5       Yes
5   France   35   58000       Yes
6    Spain   -9      -5        No
7   France   48   79000       Yes
8  Germany   50   83000        No
9   France   -9   67000       Yes

In [39]:
newdf=df.replace({
    -9:np.NaN,
    -5:np.NaN,
    'No':0
    
})
print(newdf)

   Country   Age   Salary Purchased
0   France  44.0  72000.0         0
1    Spain   NaN      NaN       Yes
2  Germany   NaN  54000.0         0
3    Spain  38.0  61000.0         0
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN      NaN         0
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0         0
9   France   NaN  67000.0       Yes

In [45]:
#to create new dataframe itself using dictionary

df=pd.DataFrame({
    'score':['exceptional','average','good','poor','average1','exceptional1'],
    'student':['rob','maya','tom','juli','eric','adda']
})
print(df)

          score student
0   exceptional     rob
1       average    maya
2          good     tom
3          poor    juli
4      average1    eric
5  exceptional1    adda

In [47]:
newdf=df.replace(['poor','good','average','exceptional1'],[1,2,3,4])
print(newdf)

         score student
0  exceptional     rob
1            3    maya
2            2     tom
3            1    juli
4     average1    eric
5            4    adda